tap "daipeihust/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Console Matrix
brew "cmatrix"
# Open source suite of directory software
brew "openldap"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Modern replacement for 'ls'
brew "exa"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Perceptual JPEG encoder
brew "guetzli"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Network authentication protocol
brew "krb5"
# Postgres C API library
brew "libpq"
# Mac App Store command-line interface
brew "mas"
# Run a Kubernetes cluster locally
brew "minikube"
# Improved JPEG encoder
brew "mozjpeg"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Install NodeJS versions
brew "node-build"
# Manage multiple NodeJS versions
brew "nodenv"
# Simplistic interactive filtering tool
brew "peco"
# General-purpose scripting language
brew "php"
# Python version management
brew "pyenv"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Cross-shell prompt for astronauts
brew "starship"
# Tool to build, change, and version infrastructure
brew "terraform"
# Terminal multiplexer
brew "tmux"
# Switch your input method through terminal
brew "daipeihust/tap/im-select"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Application launcher and productivity software
cask "alfred"
# Enable Windows-like alt-tab
cask "alt-tab"
# Memory training application
cask "anki"
# Tool to customize input devices and automate computer systems
cask "bettertouchtool"
# Web browser focusing on privacy
cask "brave-browser"
# Tool to remove unnecessary files and folders from disk
cask "cleanmymac"
# C and C++ IDE
cask "clion"
# IDE for C, C++, PHP and Node.js
cask "codelite"
# Trains AIs to understand and translate texts
cask "deepl"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Web browser
cask "firefox"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
cask "font-ricty-diminished"
# Free and open-source image editor
cask "gimp"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Utility to hide menu bar items
cask "hiddenbar"
# Tool to optimize images to a smaller size
cask "imageoptim"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Plays sound effects as you type
cask "jazzup"
# Keyboard customizer
cask "karabiner-elements"
# Interface for reading and syncing eBooks
cask "kindle"
# Preview and audit Kindle eBooks
cask "kindle-previewer"
# Explore and manipulate your MongoDB data
cask "mongodb-compass"
# Visual tool to design, develop and administer MySQL servers
cask "mysqlworkbench"
# Calculator and converter application
cask "numi"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# Task manager for teams
cask "taskade"
# To-do & task list manager
cask "ticktick"
# Development environment
cask "vagrant"
# Gives Vagrant VMware plugin access to various VMware functionalities
cask "vagrant-vmware-utility"
# Open-source code editor
cask "visual-studio-code"
# Create, manage, and run virtual machines
cask "vmware-fusion-tech-preview"
# Resources for Wacom tablets
cask "wacom-tablet"
# Video communication and virtual meeting platform
cask "zoom"
mas "ComicViewer", id: 1455702185
mas "Cursor Pro", id: 1447043133
mas "Folder Peek", id: 1615988943
mas "GarageBand", id: 682658836
mas "GoodNotes", id: 1444383602
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "MouseCatch", id: 1625127067
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
